# FabricationPartPatNo Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FabricationPartPatNo Property
ParameterTypeId Class See Also
---
"Part Pattern Number"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FabricationPartPatNo { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricationPartPatNo As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FabricationPartPatNo {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace